tap "apple/apple"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "libsql/sqld"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "tursodatabase/tap"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Statistics utility to count lines of code
brew "cloc"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose data compression with high compression ratio
brew "xz"
# Library and utilities for processing GIFs
brew "giflib"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Statically typed language for the Erlang VM
brew "gleam"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# MIME mail utilities
brew "gmime"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@15"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Waypoint
brew "hashicorp/tap/waypoint"
brew "tursodatabase/tap/turso"
brew "qmk"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
cask "font-hack-nerd-font"
# Wine wrapper built with SwiftUI
cask "whisky"
cask "ghostty"
cask "zen"
cask "font-jetbrains-mono-nerd-font"
